Add architectural diagram to README
